{"title": "Encryption scheme based on Automorphism Group of Hermitian Function Field with Homomorphic Encryption", "url": "https://arxiv.org/abs/2504.10747", "authors": ["Gennady Khalimov", "Yevgen Kotukh"], "created": "2025-04-16", "abstract": "This article proposes a comprehensive approach to implementing encryption schemes based on the automorphism group of the Hermitian function field. We utilize a three-parameter group with logarithmic representations outside the group's center. In this work, we enhance the Hermitian function field-based encryption scheme with homomorphic encryption capabilities, which constitutes a significant advantage of our implementation. Both the attack complexity and the encrypted message size are directly correlated with the order of the group."}
{"title": "Overcoming Bottlenecks in Homomorphic Encryption for the 2024 Mexican Federal Election", "url": "https://arxiv.org/abs/2504.13198", "authors": ["Eric Landquist", "Nimit Sawhney", "Simer Sawhney"], "created": "2025-04-21", "abstract": "On June 2, 2024, Mexico held its federal elections. The majority of Mexican citizens voted in person at the polls in this historic election. For the first time though, Mexican citizens living outside their country were able to vote online via a web app, either on a personal device or using an electronic voting kiosk at one of 23 embassies and consulates in the U.S., Canada, and Europe. In total, 144,734 people voted outside of Mexico: 122,496 on a personal device and 22,238 in-person at a kiosk. Voting was open for remote voting from 8PM, May 18, 2024 to 6PM, June 2, 2024 and was open for in-person voting from 8AM-6PM on June 2, 2024. This article describes the technical and cryptographic tools applied to secure the ex-patriate component of the election and to enable INE (Mexico's National Electoral Institute) to generate provable election results within minutes of the close of the election. This article will also describe how the solutions we present scale to elections on a national level."}
