{"abstract": "We show that the Whitney function of a q-matroid can be determined from the cloud and flock polynomials associated to the cyclic flats. These polynomials capture information about the corank (resp., nullity) of certain spaces whose cyclic core (resp., closure) is the given cyclic flat. Going one step further, we prove that the Whitney function, and in fact the cloud-flock lattice, are determined by the configuration of the q-matroid, which is the abstract lattice of cyclic flats together with the corank-nullity data. Furthermore, we show that the configuration and cloud-flock lattice behave well under duality and direct sums, whereas the Whitney function does not contain enough information to behave well under taking direct sums. As an aside we show that every configuration of a matroid arises as a configuration of a q-matroid, whereas the converse is not true.", "authors": ["Heide Gluesing-Luerssen", "Benjamin Jany"], "created": "2025-04-11", "title": "The Cloud and Flock Polynomials of q-Matroids", "url": "https://arxiv.org/abs/2501.14984"}
{"title": "Generalized Hofstadter functions $G, H$ and beyond: numeration systems and discrepancy", "url": "https://arxiv.org/abs/2502.12615", "authors": ["Pierre Letouzey (IRIF", "PICUBE)"], "created": "2025-04-14", "abstract": "Hofstadter's $G$ function is recursively defined via $G(0)=0$ and then $G(n)=n-G(G(n-1))$. Following Hofstadter, a family $(F_k)$ of similar functions is obtained by varying the number $k$ of nested recursive calls in this equation. We study here some Fibonacci-like sequences that are deeply connected with these functions $F_k$. In particular, the Zeckendorf theorem can be adapted to provide digital expansions via sums of terms of these sequences. On these digital expansions, the functions $F_k$ are acting as right shifts of the digits. These Fibonacci-like sequences can be expressed in terms of zeros of the polynomial $X^k{-}X^{k-1}{-}1$. Considering now the discrepancy of each function $F_k$, i.e., the maximal distance between $F_k$ and its linear equivalent, we retrieve the fact that this discrepancy is finite exactly when $k \\le 4$. Thanks to that, we solve two twenty-year-old OEIS conjectures stating how close the functions $F_3$ and $F_4$ are from the integer parts of their linear equivalents. Moreover we establish that $F_k$ can coincide exactly with such an integer part only when $k\\le 2$, while $F_k$ is almost additive exactly when $k \\le 4$. Finally, a nice fractal shape a la Rauzy has been encountered when investigating the discrepancy of $F_3$. Almost all this article has been formalized and verified in the Coq/Rocq proof assistant."}
{"abstract": "Tensor networks like matrix product states (MPSs) and matrix product operators (MPOs) are powerful tools for representing exponentially large states and operators, with applications in quantum many-body physics, machine learning, numerical analysis, and other areas. In these applications, computing a compressed representation of the MPO--MPS product is a fundamental computational primitive. For this operation, this paper introduces a new single-pass, randomized algorithm, called successive randomized compression (SRC), that improves on existing approaches in speed or in accuracy. The performance of the new algorithm is evaluated on synthetic problems and unitary time evolution problems for quantum spin systems.", "authors": ["Chris Cama\\~no", "Ethan N. Epperly", "Joel A. Tropp"], "created": "2025-04-11", "title": "Successive randomized compression: A randomized algorithm for the compressed MPO-MPS product", "url": "https://arxiv.org/abs/2504.06475"}
{"abstract": "We consider the semiring of abstract finite dynamical systems up to isomorphism, with the operations of alternative and synchronous execution. We continue searching for efficient algorithms for solving polynomial equations of the form $P(X) = B$, with a constant side B, with the goal of decomposing complex behaviors into simpler systems. Taking inspiration from the characterization of injective polynomials P over dynamical systems, which is based on a condition on the lengths of limit cycles of their coefficients, we introduce a more general notion of pseudo-injectivity by relaxing this constraint. We prove that the associated equations can be solved efficiently, even in certain cases where the input is encoded in an exponentially more compact way.", "authors": ["Antonio E. Porreca", "Marius Rolland"], "created": "2025-04-11", "title": "Solving \"pseudo-injective\" polynomial equations over finite dynamical systems", "url": "https://arxiv.org/abs/2504.06986"}
{"title": "A Krylov projection algorithm for large symmetric matrices with dense spectra", "url": "https://arxiv.org/abs/2504.06998", "authors": ["Vladimir Druskin J\\\"orn Zimmerling"], "created": "2025-04-11", "abstract": "We consider the approximation of $B^T (A+sI)^{-1} B$ for large s.p.d. $A\\in\\mathbb{R}^{n\\times n}$ with dense spectrum and $B\\in\\mathbb{R}^{n\\times p}$, $p\\ll n$. We target the computations of Multiple-Input Multiple-Output (MIMO) transfer functions for large-scale discretizations of problems with continuous spectral measures, such as linear time-invariant (LTI) PDEs on unbounded domains. Traditional Krylov methods, such as the Lanczos or CG algorithm, are known to be optimal for the computation of $(A+sI)^{-1}B$ with real positive $s$, resulting in an adaptation to the distinctively discrete and nonuniform spectra. However, the adaptation is damped for matrices with dense spectra. It was demonstrated in [Zimmerling, Druskin, Simoncini, Journal of Scientific Computing 103(1), 5 (2025)] that averaging Gau{\\ss} and Gau\\ss -Radau quadratures computed using the block-Lanczos method significantly reduces approximation errors for such problems. Here, we introduce an adaptive Kre\\u{i}n-Nudelman extension to the (block) Lanczos recursions, allowing further acceleration at negligible $o(n)$ cost. Similar to the Gau\\ss -Radau quadrature, a low-rank modification is applied to the (block) Lanczos matrix. However, unlike the Gau\\ss -Radau quadrature, this modification depends on $\\sqrt{s}$ and can be considered in the framework of the Hermite-Pad\\'e approximants, which are known to be efficient for problems with branch-cuts, that can be good approximations to dense spectral intervals. Numerical results for large-scale discretizations of heat-diffusion and quasi-magnetostatic Maxwell's operators in unbounded domains confirm the efficiency of the proposed approach."}
{"abstract": "Let $G$ be a finite abelian group and $A$ be a subset of $G \\times G$ which is corner-free, meaning that there are no $x, y \\in G$ and $d \\in G \\setminus \\{0\\}$ such that $(x, y)$, $(x+d, y)$, $(x, y+d) \\in A$. We prove that \\[|A| \\le |G|^2 \\cdot \\exp(-(\\log |G|)^{\\Omega(1)}).\\] As a consequence, we obtain polynomial (in the input length) lower bounds on the non-deterministic communication complexity of Exactly-N in the 3-player Number-on-Forehead model. We also obtain the first \"reasonable'' lower bounds on the coloring version of the $3$-dimensional corners problem and equivalently the deterministic communication complexity of Exactly-N in the 4-player Number-on-Forehead model.", "authors": ["Michael Jaber", "Yang P. Liu", "Shachar Lovett", "Anthony Ostuni", "Mehtaab Sawhney"], "created": "2025-04-11", "title": "Quasipolynomial bounds for the corners theorem", "url": "https://arxiv.org/abs/2504.07006"}
