{"abstract": "Quantifying the minimum entanglement needed to prepare quantum states and implement quantum processes is a key challenge in quantum information theory. In this work, we develop computable and faithful lower bounds on the entanglement cost under quantum operations that completely preserve the positivity of partial transpose (PPT operations), by introducing logarithmic $k$-negativity, a generalization of logarithmic negativity. Our bounds are efficiently computable via semidefinite programming and provide non-trivial values for all states that are not PPT, establishing their faithfulness. Notably, we find and affirm the irreversibility of asymptotic entanglement manipulation under PPT operations for full-rank entangled states. Furthermore, we extend our methodology to derive lower bounds on the entanglement cost of both point-to-point and bipartite quantum channels. Our bound demonstrates improvements over previously known computable bounds for a wide range of states and channels. These findings push the boundaries of understanding the structure of entanglement and the fundamental limits of entanglement manipulation.", "authors": ["Xin Wang", "Mingrui Jing", "Chengkai Zhu"], "created": "2025-04-11", "title": "Computable and Faithful Lower Bound on Entanglement Cost", "url": "https://arxiv.org/abs/2311.10649"}
{"title": "On Schr\\\"odingerization based quantum algorithms for linear dynamical systems with inhomogeneous terms", "url": "https://arxiv.org/abs/2402.14696", "authors": ["Shi Jin", "Nana Liu", "Chuwen Ma"], "created": "2025-04-15", "abstract": "We analyze the Schr\\\"odingerization method for quantum simulation of a general class of non-unitary dynamics with inhomogeneous source terms. The Schr\\\"odingerization technique, introduced in [31], transforms any linear ordinary and partial differential equations with non-unitary dynamics into a system under unitary dynamics via a warped phase transition that maps the equations into a higher dimension, making them suitable for quantum simulation. This technique can also be applied to these equations with inhomogeneous terms modeling source or forcing terms, or boundary and interface conditions, and discrete dynamical systems such as iterative methods in numerical linear algebra, through extra equations in the system. Difficulty arises with the presence of inhomogeneous terms since they can change the stability of the original system. In this paper, we systematically study-both theoretically and numerically-the important issue of recovering the original variables from the Schr\\\"odingerized equations, even when the evolution operator contains unstable modes. We show that, even with unstable modes, one can still construct a stable scheme; however, to recover the original variable, one needs to use suitable data in the extended space. We analyze and compare both the discrete and continuous Fourier transforms used in the extended dimension and derive corresponding error estimates, which allow one to use the more appropriate transform for specific equations. We also provide a smoother initialization for the Schr\\\"odingerized system to gain higher-order accuracy in the extended space. We homogenize the inhomogeneous terms with a stretch transformation, making it easier to recover the original variable. Our recovery technique also provides a simple and generic framework to solve general ill-posed problems in a computationally stable way."}
{"title": "Barren plateaus are amplified by the dimension of qudits", "url": "https://arxiv.org/abs/2405.08190", "authors": ["Lucas Friedrich", "Tiago de Souza Farias", "Jonas Maziero"], "created": "2025-04-14", "abstract": "Variational Quantum Algorithms (VQAs) have emerged as pivotal strategies for attaining quantum advantage in diverse scientific and technological domains, notably within Quantum Neural Networks. However, despite their potential, VQAs encounter significant obstacles, chief among them being the vanishing gradient problem, commonly referred to as barren plateaus. In this article, through meticulous analysis, we demonstrate that existing literature implicitly suggests the intrinsic influence of qudit dimensionality on barren plateaus. To instantiate these findings, we present numerical results that exemplify the impact of qudit dimensionality on barren plateaus. Therefore, despite the proposition of various error mitigation techniques, our results call for further scrutiny about their efficacy in the context of VQAs with qudits."}
{"title": "Oracle Separation Between Quantum Commitments and Quantum One-wayness", "url": "https://arxiv.org/abs/2410.03358", "authors": ["John Bostanci", "Boyang Chen", "Barak Nehoran"], "created": "2025-04-14", "abstract": "We show that there exists an oracle relative to which quantum commitments exist but no (efficiently verifiable) one-way state generators exist. Both have been widely considered candidates for replacing one-way functions as the minimal assumption for cryptography: the weakest cryptographic assumption implied by all of computational cryptography. Recent work has shown that commitments can be constructed from one-way state generators, but the other direction has remained open. Our results rule out any black-box construction, and thus settles this crucial open problem, suggesting that quantum commitments (as well as its equivalency class of EFI pairs, quantum oblivious transfer, and secure quantum multiparty computation) appear to be strictly weakest among all known cryptographic primitives."}
{"title": "Quantum Error Detection For Early Term Fault-Tolerant Quantum Algorithms", "url": "https://arxiv.org/abs/2503.10790", "authors": ["Tom Ginsberg", "Vyom Patel"], "created": "2025-04-14", "abstract": "Quantum error detection (QED) offers a promising pathway to fault tolerance in near-term quantum devices by balancing error suppression with minimal resource overhead. However, its practical utility hinges on optimizing design parameters-such as syndrome measurement frequency-to avoid diminishing returns from detection overhead. In this work, we present a comprehensive framework for fault-tolerant compilation and simulation of quantum algorithms using [[n, n-2, 2]] codes, which enable low-qubit-overhead error detection and a simple nearly fault-tolerant universal set of operations. We demonstrate and analyze our pipeline with a purely statistical interpretation and through the implementation of Grover's search algorithm. Our results are used to answer the question is quantum error detection a worthwhile avenue for early-term fault tolerance, and if so how can we get the most out of it? Simulations under the circuit-level noise model reveal that finding optimal syndrome schedules improves algorithm success probabilities by an average of 6.7x but eventual statistical limits from post-selection in noisy/resource-limited regimes constrain scalability. Furthermore, we propose a simple data-driven approach to predict fault tolerant compilation parameters, such as optimal syndrome schedules, and expected fault tolerant performance gains based on circuit and noise features. These results provide actionable guidelines for implementing QED in early-term quantum experiments and underscore its role as a pragmatic, constant-overhead error mitigation layer for shallow algorithms. To aid in further research, we release all simulation data computed for this work and provide an experimental QED compiler at https://codeqraft.xyz/qed."}
{"abstract": "Variational quantum algorithms (VQA) based on Hamiltonian simulation represent a specialized class of quantum programs well-suited for near-term quantum computing applications due to its modest resource requirements in terms of qubits and circuit depth. Unlike the conventional single-qubit (1Q) and two-qubit (2Q) gate sequence representation, Hamiltonian simulation programs are essentially composed of disciplined subroutines known as Pauli exponentiations (Pauli strings with coefficients) that are variably arranged. To capitalize on these distinct program features, this study introduces PHOENIX, a highly effective compilation framework that primarily operates at the high-level Pauli-based intermediate representation (IR) for generic Hamiltonian simulation programs. PHOENIX exploits global program optimization opportunities to the greatest extent, compared to existing SOTA methods despite some of them also utilizing similar IRs. PHOENIX employs the binary symplectic form (BSF) to formally describe Pauli strings and reformulates IR synthesis as reducing the column weights of BSF by appropriate Clifford transformations. It comes with a heuristic BSF simplification algorithm that searches for the most appropriate 2Q Clifford operators in sequence to maximally simplify the BSF at each step, until the BSF can be directly synthesized by basic 1Q and 2Q gates. PHOENIX further performs a global ordering strategy in a Tetris-like fashion for these simplified IR groups, carefully balancing optimization opportunities for gate cancellation, minimizing circuit depth, and managing qubit routing overhead. Experimental results demonstrate that PHOENIX outperforms SOTA VQA compilers across diverse program categories, backend ISAs, and hardware topologies.", "authors": ["Zhaohui Yang", "Dawei Ding", "Chenghong Zhu", "Jianxin Chen", "Yuan Xie"], "created": "2025-04-11", "title": "PHOENIX: Pauli-Based High-Level Optimization Engine for Instruction Execution on NISQ Devices", "url": "https://arxiv.org/abs/2504.03529"}
{"abstract": "Geometric Machine Learning (GML) has shown that respecting non-Euclidean geometry in data spaces can significantly improve performance over naive Euclidean assumptions. In parallel, Quantum Machine Learning (QML) has emerged as a promising paradigm that leverages superposition, entanglement, and interference within quantum state manifolds for learning tasks. This paper offers a unifying perspective by casting QML as a specialized yet more expressive branch of GML. We argue that quantum states, whether pure or mixed, reside on curved manifolds (e.g., projective Hilbert spaces or density-operator manifolds), mirroring how covariance matrices inhabit the manifold of symmetric positive definite (SPD) matrices or how image sets occupy Grassmann manifolds. However, QML also benefits from purely quantum properties, such as entanglement-induced curvature, that can yield richer kernel structures and more nuanced data embeddings.", "authors": ["Azadeh Alavia", "Hossein Akhoundib", "Fatemeh Kouchmeshkib", "Mojtaba Mahmoodianc", "Sanduni Jayasinghec", "Yongli Rena", "Abdolrahman Alavi"], "created": "2025-04-11", "title": "A Geometric-Aware Perspective and Beyond: Hybrid Quantum-Classical Machine Learning Methods", "url": "https://arxiv.org/abs/2504.06328"}
{"abstract": "Quantum computing leverages the unique properties of qubits and quantum parallelism to solve problems intractable for classical systems, offering unparalleled computational potential. However, the optimization of quantum circuits remains critical, especially for noisy intermediate-scale quantum (NISQ) devices with limited qubits and high error rates. Genetic algorithms (GAs) provide a promising approach for efficient quantum circuit synthesis by automating optimization tasks. This work examines the impact of various mutation strategies within a GA framework for quantum circuit synthesis. By analyzing how different mutations transform circuits, it identifies strategies that enhance efficiency and performance. Experiments utilized a fitness function emphasizing fidelity, while accounting for circuit depth and T operations, to optimize circuits with four to six qubits. Comprehensive hyperparameter testing revealed that combining delete and swap strategies outperformed other approaches, demonstrating their effectiveness in developing robust GA-based quantum circuit optimizers.", "authors": ["Michael K\\\"olle", "Tom Bintener", "Maximilian Zorn", "Gerhard Stenzel", "Leo S\\\"unkel", "Thomas Gabor", "Claudia Linnhoff-Popien"], "created": "2025-04-11", "title": "Evaluating Mutation Techniques in Genetic Algorithm-Based Quantum Circuit Synthesis", "url": "https://arxiv.org/abs/2504.06413"}
{"abstract": "This study explores the intersection of continuous-variable quantum computing (CVQC) and classical machine learning, focusing on CVQC data encoding techniques, including Displacement encoding and squeezing encoding, alongside Instantaneous Quantum Polynomial (IQP) encoding from discrete quantum computing. We perform an extensive empirical analysis to assess the impact of these encoding methods on classical machine learning models, such as Logistic Regression, Support Vector Machines, K-Nearest Neighbors, and ensemble methods like Random Forest and LightGBM. Our findings indicate that CVQC-based encoding methods significantly enhance feature expressivity, resulting in improved classification accuracy and F1 scores, especially in high-dimensional and complex datasets. However, these improvements come with varying computational costs, which depend on the complexity of the encoding and the architecture of the machine learning models. Additionally, we examine the trade-off between quantum expressibility and classical learnability, offering valuable insights into the practical feasibility of incorporating these quantum encodings into real-world applications. This study contributes to the growing body of research on quantum-classical hybrid learning, emphasizing the role of CVQC in advancing quantum data representation and its integration into classical machine learning workflows.", "authors": ["Minati Rath", "Hema Date"], "created": "2025-04-11", "title": "Continuous-Variable Quantum Encoding Techniques: A Comparative Study of Embedding Techniques and Their Impact on Machine Learning Performance", "url": "https://arxiv.org/abs/2504.06497"}
{"abstract": "In this work, we present an efficient algorithm for multivariate mean value estimation. Our algorithm outperforms previous work by polylog factors and nearly saturates the known lower bound. We find an algorithm that uses $O\\left(n \\log \\frac{d}{\\delta}\\right)$ to achieve precision $\\frac{\\sqrt{\\text{tr } \\Sigma}}{n}$ in $\\lVert \\rVert_\\infty$ norm and hence $\\frac{\\sqrt{d \\text{ tr } \\Sigma}}{n}$ in $\\lVert \\rVert_2$ norm, where $d$ is the dimension and $\\Sigma$ is the covariance matrix. We also presented another algorithm that uses smaller memory but costs an extra $d^\\frac{1}{4}$ in complexity. The idea originates from the previous observations that the Grover gate, when generalized to allow for arbitrary phases instead of $\\pm 1$, becomes a good mean value estimator in some mathematical notion. The only remaining $\\log \\frac{d}{\\delta}$ as opposed to $\\log \\frac{1}{\\delta}$ is due to the phase estimation primitive we employed, which so far is the only major known method to tackle the problem. Our results demonstrates that our methodology with generalized Grover gate can be used locate the optimal algorithm, without polylog overhead, for different taks relating to mean value estimation.", "authors": ["Letian Tang"], "created": "2025-04-11", "title": "More-efficient Quantum Multivariate Mean Value Estimator from Generalized Grover Gate", "url": "https://arxiv.org/abs/2504.06940"}
{"abstract": "This work explores structured matrix sequences arising in mean-field quantum spin systems. We express these sequences within the framework of generalized locally Toeplitz (GLT) $*$-algebras, leveraging the fact that each GLT matrix sequence has a unique GLT symbol. This symbol characterizes both the asymptotic singular value distribution and, for Hermitian or quasi-Hermitian sequences, the asymptotic spectral distribution. Specifically, we analyze two cases of real symmetric matrix sequences stemming from mean-field quantum spin systems and determine their associated distributions using GLT theory. Our study concludes with visualizations and numerical tests that validate the theoretical findings, followed by a discussion of open problems and future directions.", "authors": ["Christiaan J. F. van de Ven", "Muhammad Faisal Khan", "S. Serra-Capizzano"], "created": "2025-04-11", "title": "GLT hidden structures in mean-field quantum spin systems", "url": "https://arxiv.org/abs/2504.06951"}
{"abstract": "Multi-programming quantum computers improve device utilization and throughput. However, crosstalk from concurrent two-qubit CNOT gates poses security risks, compromising the fidelity and output of co-running victim programs. We design Zero Knowledge Tampering Attacks (ZKTAs), using which attackers can exploit crosstalk without knowledge of the hardware error profile. ZKTAs can alter victim program outputs in 40% of cases on commercial systems.", "authors": ["Avinash Kumar", "Meng Wang", "Chenxu Liu", "Ang Li", "Prashant J. Nair", "Poulami Das"], "created": "2025-04-11", "title": "Context Switching for Secure Multi-programming of Near-Term Quantum Computers", "url": "https://arxiv.org/abs/2504.07048"}
{"abstract": "Reverse Shannon theorems concern the use of noiseless channels to simulate noisy ones. This is dual to the usual noisy channel coding problem, where a noisy (classical or quantum) channel is used to simulate a noiseless one. The Quantum Reverse Shannon Theorem is extensively studied by Bennett and co-authors in [IEEE Trans. Inf. Theory, 2014]. They present two distinct theorems, each tailored to classical and quantum channel simulations respectively, explaining the fact that these theorems remain incomparable due to the fundamentally different nature of correlations they address. The authors leave as an open question the challenge of formulating a unified theorem that could encompass the principles of both and unify them. We unify these two theorems into a single, comprehensive theorem, extending it to the most general case by considering correlations with a general mixed-state reference system. Furthermore, we unify feedback and non-feedback theorems by simulating a general side information system at the encoder side.", "authors": ["Zahra Baghali Khanian", "Debbie Leung"], "created": "2025-04-11", "title": "Quantum Reverse Shannon Theorem Revisited", "url": "https://arxiv.org/abs/2504.07068"}
{"title": "Efficient measurement of neutral-atom qubits with matched filters", "url": "https://arxiv.org/abs/2504.08170", "authors": ["Robert M. Kent", "Linipun Phuttitarn", "Chaithanya Naik Mude", "Swamit Tannu", "Mark Saffman", "Gregory Lafyatis", "Daniel J. Gauthier"], "created": "2025-04-14", "abstract": "Quantum computers require high-fidelity measurement of many qubits to achieve a quantum advantage. Traditional approaches suffer from readout crosstalk for a neutral-atom quantum processor with a tightly spaced array. Although classical machine learning algorithms based on convolutional neural networks can improve fidelity, they are computationally expensive, making it difficult to scale them to large qubit counts. We present two simpler and scalable machine learning algorithms that realize matched filters for the readout problem. One is a local model that focuses on a single qubit, and the other uses information from neighboring qubits in the array to prevent crosstalk among the qubits. We demonstrate error reductions of up to 32% and 43% for the site and array models, respectively, compared to a conventional Gaussian threshold approach. Additionally, our array model uses two orders of magnitude fewer trainable parameters and four orders of magnitude fewer multiplications and nonlinear function evaluations than a recent convolutional neural network approach, with only a minor (3.5%) increase in error across different readout times. Another strength of our approach is its physical interpretability: the learned filter can be visualized to provide insights into experimental imperfections. We also show that a convolutional neural network model for improved can be pruned to have 70x and 4000x fewer parameters, respectively, while maintaining similar errors. Our work shows that simple machine learning approaches can achieve high-fidelity qubit measurements while remaining scalable to systems with larger qubit counts."}
{"title": "Quantum Natural Language Processing: A Comprehensive Review of Models, Methods, and Applications", "url": "https://arxiv.org/abs/2504.09909", "authors": ["Farha Nausheen", "Khandakar Ahmed", "M Imad Khan"], "created": "2025-04-15", "abstract": "In recent developments, deep learning methodologies applied to Natural Language Processing (NLP) have revealed a paradox: They improve performance but demand considerable data and resources for their training. Alternatively, quantum computing exploits the principles of quantum mechanics to overcome the computational limitations of current methodologies, thereby establishing an emerging field known as quantum natural language processing (QNLP). This domain holds the potential to attain a quantum advantage in the processing of linguistic structures, surpassing classical models in both efficiency and accuracy. In this paper, it is proposed to categorise QNLP models based on quantum computing principles, architecture, and computational approaches. This paper attempts to provide a survey on how quantum meets language by mapping state-of-the-art in this area, embracing quantum encoding techniques for classical data, QNLP models for prevalent NLP tasks, and quantum optimisation techniques for hyper parameter tuning. The landscape of quantum computing approaches applied to various NLP tasks is summarised by showcasing the specific QNLP methods used, and the popularity of these methods is indicated by their count. From the findings, it is observed that QNLP approaches are still limited to small data sets, with only a few models explored extensively, and there is increasing interest in the application of quantum computing to natural language processing tasks."}
